final-project-resources/run-grid-coarse-KVLCC2-SA/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object snappyHexMeshDict;
}

    castellatedMesh true;
    snap true;
    addLayers true;
    geometry
    {
        kvlcc2.stl
        {
            type triSurfaceMesh;
            name hull;
            
            patchInfo
            {
                type wall;
            }
        }
        stern 
        {
            type searchableBox;
            min ( 1.6 -0.29  -0.25);
            max ( 3.4  0.29  0.0);
        }
        
        wake
        {
            type searchableBox;
            min (-0.4 -0.4  -0.3);
            max ( 5.6  0.4  0.0);
        }

    }

    castellatedMeshControls
    {
        features
        (
            {
                file "kvlcc2_line0.eMesh";
                level 5;
            }
            {
                file "kvlcc2_line1a-mirrored.eMesh";
                level 5;
            }
            {
                file "kvlcc2_line1b-mirrored.eMesh";
                level 5;
            }
            {
                file "kvlcc2_line2-mirrored.eMesh";
                level 5;
            }
        );
        
        refinementSurfaces
        {
            hull
            {
                level ( 5 5 );
            }

        }

        refinementRegions
        {
            stern
            {
                mode inside;
                levels ((4 4));
            }
            
            wake
            {
                mode inside;
                levels ((3 3));
            }

        }

        locationInMesh ( 10 1 -0.5);
        maxLocalCells  2000000;
        maxGlobalCells 20000000;
        minRefinementCells 0;
        nCellsBetweenLevels 3;
        resolveFeatureAngle 10;
        allowFreeStandingZoneFaces false;
        planarAngle 30;
        maxLoadUnbalance 0.10;
    }

    snapControls
    {
        nSolveIter 50;
        nSmoothPatch 3;
        tolerance 2.0;
        nRelaxIter 5;
        nFeatureSnapIter 10;
        implicitFeatureSnap false;
        explicitFeatureSnap true;
        multiRegionFeatureSnap false;
    }

    addLayersControls
    {
        layers
        {
            "hull"
            {nSurfaceLayers 5;}
        }

        relativeSizes true;
        expansionRatio 1.2;
        finalLayerThickness 0.8;
        //finalLayerThickness 0.4;
        minThickness 0.0001;
        nGrow 0;
        featureAngle 120;
        slipFeatureAngle 60;
        nRelaxIter 5;
        nSmoothSurfaceNormals 1;
        nSmoothNormals 3;
        nSmoothThickness 10;
        maxFaceThicknessRatio 0.5;
        maxThicknessToMedialRatio 0.3;
        minMedialAxisAngle 90;
        nBufferCellsNoExtrude 0;
        nLayerIter 50;
        nRelaxedIter 20;
        writeVTK false;
        noErrors false;
        layerRecovery 1;
        growZoneLayers false;
        projectGrownUp 0.0;
    }

    meshQualityControls
    {
        maxNonOrtho 75;
        maxBoundarySkewness 20;
        maxInternalSkewness 8;
        maxConcave 70;
        minFlatness 0.5;
        minVol 1.00E-13;
        minArea -1;
        minTetQuality -1e30;
        minTwist 0.004;
        minDeterminant 0.001;
        minFaceWeight 0.03;
        minVolRatio 0.01;
        minTriangleTwist -1;
        nSmoothScale 4;
        errorReduction 0.75;
    }

    debug 0;
    mergeTolerance 1E-6;
    autoBlockMesh false;
